; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite5 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	infrared1 - mode
	spectrograph2 - mode
	image3 - mode
	Star2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(supports instrument2 image3)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument3 thermograph0)
	(supports instrument3 image3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite4)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image3)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star5)
	(supports instrument8 spectrograph2)
	(supports instrument8 image3)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument6 satellite5)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation1)
)
(:goal (and
	(have_image Phenomenon6 image3)
	(have_image Phenomenon7 image3)
	(have_image Planet8 image3)
	(have_image Planet9 thermograph0)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 infrared1)
))

)

; plan
1. (turn_to satellite2 groundstation1 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 7
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite2 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite2 phenomenon6 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon6)
   goals met: 0 of 7
5. (take_image satellite2 phenomenon6 instrument2 image3)
   added: (have_image phenomenon6 image3)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon11 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 7
8. (take_image satellite2 phenomenon11 instrument2 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 2 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
10. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 7
11. (turn_to satellite0 planet12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet12)
   goals met: 2 of 7
12. (take_image satellite0 planet12 instrument0 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 3 of 7
13. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 3 of 7
14. (take_image satellite0 planet9 instrument0 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 4 of 7
15. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 4 of 7
16. (take_image satellite0 star10 instrument0 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 5 of 7
17. (turn_to satellite2 phenomenon7 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon7)
   goals met: 5 of 7
18. (take_image satellite2 phenomenon7 instrument2 image3)
   added: (have_image phenomenon7 image3)
   goals met: 6 of 7
19. (turn_to satellite2 planet8 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet8)
   goals met: 6 of 7
20. (take_image satellite2 planet8 instrument2 image3)
   added: (have_image planet8 image3)
   goals met: 7 of 7
